{
    "version": "https://jsonfeed.org/version/1",
    "title": "ASI",
    "description": "",
    "home_page_url": "https://checofran284-alt.github.io/2damasi",
    "feed_url": "https://checofran284-alt.github.io/2damasi/feed.json",
    "user_comment": "",
    "icon": "https://checofran284-alt.github.io/2damasi/media/website/logo-para-web-person.png",
    "author": {
        "name": "Francisco Ferres"
    },
    "items": [
        {
            "id": "https://checofran284-alt.github.io/2damasi/como-lo-he-hecho/",
            "url": "https://checofran284-alt.github.io/2damasi/como-lo-he-hecho/",
            "title": "&quot;Como lo he hecho&quot;",
            "summary": "Para crear mi sitio web utilicé Publii, un generador de sitios estáticos que me permitió construir una web rápida, segura&hellip;",
            "content_html": "<blockquote>\n<p>Para crear mi sitio web utilicé Publii, un generador de sitios estáticos que me permitió construir una web rápida, segura y sin necesidad de base de datos. El proceso fue el siguiente:<br><br><span style=\"text-decoration: underline;\"><em><strong>1. Elección del tema</strong></em></span><br><br>Seleccioné el tema Editorial 2 desde el Marketplace de Publii, por su diseño limpio, estructura lateral y enfoque editorial. Este tema me permitió destacar tanto mi presentación personal como mis publicaciones.<br><br><strong><span style=\"text-decoration: underline;\">2. Creación de contenido</span></strong><br><br>•     Redacté una página principal que sirve como portada del sitio, donde explico quién soy y qué hago.<br>•     Escribí un post titulado “Quién soy”, que amplía mi historia personal y profesional.<br>•     Configuré la página como homepage desde los ajustes del sitio, para que sea lo primero que vean los visitantes.<br><br><span style=\"text-decoration: underline;\"><em><strong>3. Integración de página y post</strong></em></span><br><br>Como Publii no muestra automáticamente los posts debajo de una página estática, añadí manualmente un enlace al post dentro del contenido de la página. Esto lo hice usando Markdown, enlazando el post directamente con su slug (), para que todo esté accesible desde la misma vista.<br><br><em><span style=\"text-decoration: underline;\"><strong>4. Configuración del menú</strong></span></em><br><br>Personalicé el menú lateral del tema para incluir:<br>•     Enlace a la página principal<br>•     Enlace directo al post<br>•     Espacio para futuras secciones como Portfolio, Contacto o Blog<br><br><strong><em><span style=\"text-decoration: underline;\">5. Publicación del sitio</span></em></strong><br><br>Una vez terminado el contenido y la estructura, utilicé la función “Synchronize Website” para publicar el sitio en mi servidor o plataforma de hosting estático.</p>\n</blockquote>",
            "author": {
                "name": "Francisco Ferres"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T15:43:04+02:00",
            "date_modified": "2025-09-26T16:03:01+02:00"
        },
        {
            "id": "https://checofran284-alt.github.io/2damasi/quien-soy/",
            "url": "https://checofran284-alt.github.io/2damasi/quien-soy/",
            "title": "¿Quién soy?",
            "summary": "Me llamo Francisco Ferres y soy un Desarrollador de Aplicaciones Multiplataforma (DAM) en proceso🙂. Me apasiona la tecnología, el diseño&hellip;",
            "content_html": "<blockquote>\n<p class=\"align-center\">Me llamo Francisco Ferres y soy un Desarrollador de Aplicaciones Multiplataforma (DAM) en proceso🙂. Me apasiona la tecnología, el diseño de software y todo lo que tenga que ver con con el sector informático.</p>\n<hr>\n<p class=\"align-center\">Desde que estudio programación, descubrí que el código no es solo lógica, ya que si indagamos un poco más también puede ser creatividad, estructura y comunicación. Me gusta trabajar en equipo combinando rendimiento, desarrollo y experiencia con cada miembro del equipo asignado, algo que en los proyectos valoro para marcar la diferencia💪.</p>\n<hr>\n<p class=\"align-center\">He desarrollado apps móviles, APIs REST, scripts de automatización y sistemas de trazabilidad. Me manejo con tecnologías como Java, SQL, HTML, CSS, y herramientas como Git, GitHub, metodologías ágiles e integración continua.</p>\n<hr>\n<p class=\"align-center\">Además de lo técnico informático, me interesa la pasión automotor, la identidad recetas de comida y la identidad digital,  además, los desarrolladores en formación como yo podemos compartir lo que aprendemos para crecer juntos😎. Por eso he creado esta web: para mostrar lo que hago, lo que aprendo y lo que me apasiona.</p>\n<hr>\n<p class=\"align-center\">Si has llegado hasta aquí, gracias por leer. Y si quieres conectar, colaborar o simplemente charlar sobre tecnología, estaré encantado.</p>\n<p><br>Francisco Ferres</p>\n</blockquote>",
            "author": {
                "name": "Francisco Ferres"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T12:10:35+02:00",
            "date_modified": "2025-09-26T15:50:26+02:00"
        }
    ]
}
